//=============================================================================
//
// レンダラー処理 [renderer.h]
// Author : YUTARO ABE
//
//=============================================================================
#ifndef _RENDERER_H_
#define _RENDERER_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"		// メイン

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CCamera;
//*****************************************************************************
// クラス定義
//*****************************************************************************
class CRenderer
{// レンダラー
public:
	CRenderer();								// コンストラクタ
	~CRenderer();								// デストラクタ

	HRESULT Init(HWND hWnd, bool bWindow);		// 初期化処理
	void Uninit(void);							// 終了処理
	void Update(void);							// 更新処理
	void Draw(void);							// 描画処理
	LPDIRECT3DDEVICE9 GetDevice(void) { return m_pD3DDevice; }	// デバイス取得
private:
	LPDIRECT3D9				m_pD3D;				// Direct3Dオブジェクト
	LPDIRECT3DDEVICE9		m_pD3DDevice;		// Deviceオブジェクト(描画に必要)
	bool					m_bWire;			// 描画をWire状にするかしないか
	CCamera					*m_pCamera;			//	カメラの取得
protected:

};

#endif