//=============================================================================
//
// 影処理 [3dobject.h]
// Author : YUTARO ABE
//
//=============================================================================
#ifndef _SHADOW_H_
#define _SHADOW_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"		// メイン
#include "scene3d.h"	// シーン
#include "player.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CShadow : public CScene3D
{// シーン3D（親：CScene）
public:
	CShadow();															// コンストラクタ
	~CShadow();															// デストラクタ
																		// 初期化処理
	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size, D3DXCOLOR col, D3DXVECTOR2 TexUV);
	void Uninit(void);													// 終了処理
	void Update(void);													// 更新処理
	void Draw(void);													// 描画処理
																		// 生成
	static CShadow *Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size, D3DXCOLOR col, D3DXVECTOR2 TexUV);
	static HRESULT Load(void);											// テクスチャの読み込み
	static void Unload(void);											// 破棄

private:
	static LPDIRECT3DTEXTURE9		m_pTexture;							// テクスチャ情報へのポインタ
	D3DXMATRIX						m_mtxWorld;							// ワールドマトリックス

protected:
};

#endif